cplutils/readers/tests/data/openfoam_case/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
960
(
125.9921
125.9921
125.9921
125.9921
125.9921
125.9921
125.9921
125.9921
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
)
;
    }
    CPLReceiveMD
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
62.996052
)
;
    }
    streamwiseIn
    {
        type            cyclic;
    }
    streamwiseOut
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
