cplutils/readers/tests/data/openfoam_case/0/ccz
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
960
(
3.9685026
3.9685026
3.9685026
3.9685026
3.9685026
3.9685026
3.9685026
3.9685026
...
)
;

boundaryField
{
    movingWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
3.9685026
11.905508
19.842513
27.779518
3.9685026
11.905508
19.842513
27.779518
3.9685026
11.905508
19.842513
27.779518
3.9685026
11.905508
19.842513
27.779518
)
;
    }
    CPLReceiveMD
    {
        type            calculated;
        value           nonuniform List<scalar> 
16
(
3.9685026
11.905508
19.842513
27.779518
3.9685026
11.905508
19.842513
27.779518
3.9685026
11.905508
19.842513
27.779518
3.9685026
11.905508
19.842513
27.779518
)
;
    }
    streamwiseIn
    {
        type            cyclic;
    }
    streamwiseOut
    {
        type            cyclic;
    }
    front
    {
        type            cyclic;
    }
    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
